{
  "home": {
    "home": "Мене звати",
    "download": "Загрузити",
    "name": "Олег",
    "surname": "Надєїн",
    "error": "Oops, У нас виникла проблема."
  },
  "about": {
    "about": "Про мене",
    "title": "Спортсмен, який захоплюється математикою і використовує свою волю до перемоги, цілеспрямованість і навички планування для досягнення як особистих, так і професійних цілей. Мій страх перед викликами перетворюється на мотивацію для постійного самовдосконалення. Моє бажання поєднати пристрасть до спорту з розробкою програмного забезпечення робить мене унікальним кандидатом на посаду front-end розробника, який принесе енергію, мотивацію та технічні навички для досягнення чудових результатів. Мета мого вивчення JavaScript для бекенд-розробки та фреймворків - вміти реалізовувати складні та потужні функції веб-додатків, забезпечуючи при цьому високу продуктивність, безпеку та масштабованість.",
    "experience": "досвід",
    "organization": "Благодійна організація",
    "projectFuture": {
      "responsibilities": {
        "1": "Створення та підтримка додатку організації, забезпечення його зручного інтерфейсу та коректної роботи на всіх пристроях.",
        "2": "Розробити інтерактивні інтерфейси для відображення інформації про програми та послуги, що надаються ветеранам та їхнім сім'ям.",
        "3": "Співпраця з іншими командами, включаючи дизайнерів і команду замовника, для виконання спільних завдань і досягнення цілей організації.",
        "4": "Встановлення та налаштування Strapi на сервері, включаючи налаштування бази даних та інших параметрів. Зв'язок між Strapi та фронтенд-додатком для отримання та відображення контенту на веб-сайті або в додатку.",
        "5": "Інновації та технологічний розвиток: Дослідження та впровадження нових технологій та інновацій для покращення функціональності та взаємодії з веб-сайтом.",
        "6": "Розробка платіжної системи: Розробка інтерфейсу обробки пожертвувань, включаючи можливість вибору суми, зручного способу оплати та заповнення необхідних даних.",
        "7": "Створення візуально привабливих інтерфейсів: розробка інтерфейсів, які вражають і привертають увагу користувачів завдяки стильним компонентам Material-UI, таким як красиві кнопки, елегантні форми, інформативні таблиці та привабливі картки.",
        "8": "Налаштуйте палітру кольорів: створюйте теми Material-UI, які відображають корпоративні кольори та дизайн вашого проекту, надаючи інтерфейсу єдиний вигляд і відчуття."
      }
    },
    "freelanceProjects": {
      "responsibilities": {
        "1": "Розробив 10 різноманітних додатків React, використовуючи компоненти класу, хуки та маршрутизатори React, одночасно реалізовуючи функції обробки даних і зв’язок клієнт-сервер через API",
        "2": "Здійснював перевірку якості коду для більш ніж 40 проектів, надаючи цінні пропозиції та коментарі членам команди та колегам",
        "3": "Забезпечення чистого, зручного для обслуговування та легкого для читання коду (2k+ рядків) з дотриманням найкращих практик та використанням професійної документації",
        "4": "Досвідчений в управлінні станом додатків за допомогою Redux і Redux Toolkit для великих і складних додатків",
        "5": "Продемонстрував досвід створення високоякісних веб-сторінок (10 HTML/CSS проектів) від дизайну до розгортання, використовуючи HTML, CSS, SASS, а також JS, React, Vue."
      }
    },
    "courses": "НАВЧАННЯ / КУРСИ"
  },
  "project": {
    "description": {
      "2": "Додаток для управління завданнями, створений з React",
      "3": "Додаток з API Нової Пошти, за допомогою якого ви можете відстежувати статус вашої посилки",
      "4": "Гра на з'єднання пронумерованих плиток до 2048 року",
      "5": "Веб-сторінка, яка висвітлює різноманітний асортимент велосипедів, аксесуарів та послуг, які пропонує магазин",
      "6": "Веб-сторінка, яка демонструє експонати, історію та унікальні особливості музею",
      "7": "Dia (Стратегічна агенція. Створює додаткову цінність для компаній, продуктів та послуг, а також вербальні та візуальні способи донесення її до аудиторії)."
    }, 
    "technologies" : "Технології",
    "desc": "Oпис",
    "projects": "Проєкти",
    "footer": "Ви можете побачити інші проекти на моєму GitHub"
    
  },
  "skills": {
    "skills": "Навички",
    "aristotle": "Інтелект - це не тільки знання, а й уміння застосовувати знання на практиці. на практиці.",
    "more": "Ще більше попереду"
  },
  "footer": {
    "touch": "Зв'яжіться зі мною"
  },
  "header": {
    "home": "На домашню",
    "about": "Про мене",
    "skills": "Навички",
    "projects": "Проєкти"
  }
}
